snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ЛистСборкиКомплектовЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистСборкиКомплектовЧЗ</name>
  <comment>Лист сборки комплектов маркированого товара </comment>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фРежим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СборщикКомплектаТСД</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>КодКомплектаПодтвержденСканированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующее</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКомплекта</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФормированияКомплекта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКомплектующегоНеНанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ИспользованныеКодыАгрегаций/ИспользованныеКодыАгрегаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованныеКодыАгрегаций</name>
  <comment>Использованные коды агрегаций</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт_А/СтатусыКМ_Факт_А.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт_А</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиДоступныхКМ/ОстаткиДоступныхКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиДоступныхКМ</name>
  <resources>
    <name>ЭмитированноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоступноКМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Нанесен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/ЖурналИзмененийРеквизитов/ЖурналИзмененийРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналИзмененийРеквизитов</name>
  <resources>
    <name>СтароеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НовоеЗначение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыКодовМаркировки/ТипыКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКодовМаркировки</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЛистСборкиКомплектовЧЗ/ManagerModule.bsl
//Добавляет комплект в РНК
//
//Параметры:
//	ЛистНабора		- Документ.ЛистНабора, Документ.ЛистПеремаркировки - Cсылка на лист набора или перемаркировки
//	Продукция		- Справочник.Номенклатура, Справочник.ШтрихКодыУпаковок - Cсылка на комплект (продукцию) или ссылка на код маркировки продукции
//	Комплектующие	- ТаблицаЗначений - Таблица комплектующих 
//	Колонки
//		Номенклатура	- Справочник.Номенклатура
//		ШтрихКод		- Справочник.ШтрихКоды,Справочник.ШтрихкодыУпаковокТоваров
//		Количество 		- Число (1 - для КМ, произвольное для обычного ШК)
// Возвращаемое значение:
//   СтруктураРезультата  - стандартная структура результата
Функция ДобавитьКомплектВНакладную(ЛистНабора, Продукция, Комплектующие) Экспорт
	Накладная		= ПолучитьРеквизитШапки(ЛистНабора, "ДокОснование");	
	ЗаданиеНаСборку = НайтиСоздатьЗаданиеНаСборку(Накладная, ЛистНабора);
	ЛистСборки		= НайтиСоздатьЛистСборки(ЗаданиеНаСборку, ЛистНабора);
	
	Возврат ДобавитьКомплектВЛистСборки(ЛистСборки, Продукция, Комплектующие);
КонецФункции //ДобавитьКомплектВНакладную(Накладная, ЛистНабора, Продукция, Комплектующие) Экспорт

//Добавляет комплект в лист сборки
//
//Параметры:
//	ЛистСборки		- Документ.ЛистСборкиКомплектовЧЗ - Cсылка на лист сборки
//	ПродукцияВход	- Справочник.Номенклатура, Справочник.ШтрихКодыУпаковок - Cсылка на комплект (продукцию) или ссылка на код маркировки продукции
//	Комплектующие	- ТаблицаЗначений - Таблица комплектующих 
//	Колонки
//		Номенклатура	- Справочник.Номенклатура
//		ШтрихКод		- Справочник.ШтрихКоды,Справочник.ШтрихкодыУпаковокТоваров
//		Количество 		- Число (1 - для КМ, произвольное для обычного ШК)
// Возвращаемое значение:
//   СтруктураРезультата  - стандартная структура результата
Функция ДобавитьКомплектВЛистСборки(ЛистСборки, ПродукцияВход, Комплектующие) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ТипЗнч(ПродукцияВход) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
		Продукция = ПолучитьРеквизитШапки(ПродукцияВход, "Владелец");
	Иначе
		Продукция = ПродукцияВход;
	КонецЕсли; 
	
	КодыКомплектующих = Комплектующие.СкопироватьКолонки();
	
	рПроверки = ПроверитьДублиКодов(ЛистСборки, Комплектующие);
	Если рПроверки.Успешно Тогда
		Для Каждого СтрокаК Из Комплектующие Цикл
			Если ТипЗнч(СтрокаК.ШтрихКод) = Тип("СправочникСсылка.ШтрихКоды") Тогда
				рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(СтрокаК.Номенклатура, ЛистСборки, Новый Структура("Количество", СтрокаК.Количество));
				Если рПолучения.Успешно Тогда
					Для Каждого ШтрихКодУпаковки Из рПолучения.Данные Цикл
						СтрокаР = КодыКомплектующих.Добавить();					
						
						СтрокаР.Номенклатура = СтрокаК.Номенклатура;
						СтрокаР.ШтрихКод	 = ШтрихКодУпаковки;
						СтрокаР.Количество	 = 1;
					КонецЦикла; 
				Иначе					
					МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);				
				КонецЕсли;
			Иначе
				СтрокаР = Результат.Данные.Добавить();					
				ЗаполнитьЗначенияСвойств(СтрокаР, СтрокаК);						
			КонецЕсли; 		
		КонецЦикла;		
	Иначе
		МаркировкаКС.ДобавитьОшибки(Результат, рПроверки);
	КонецЕсли;
	
	Результат.Данные.Вставить("КодыКомплектующих", КодыКомплектующих);
	
	Если Результат.Ошибки.Количество() = 0 Тогда
		Результат.Данные = Новый Структура("КодыКомплектующих", КодыКомплектующих);
		
		Если ТипЗнч(ПродукцияВход) = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров") Тогда
			Результат.Данные.Вставить("ШтрихкодКомплекта", ПродукцияВход);
		Иначе
			рПолучения = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Продукция, ЛистСборки, Новый Структура("Количество", 1));
			Если рПолучения.Успешно Тогда
				Результат.Данные.Вставить("ШтрихкодКомплекта", рПолучения.Данные[0]);
			Иначе
				МаркировкаКС.ДобавитьОшибки(Результат, рПроверки);			
			КонецЕсли;			
		КонецЕсли;
			
	КонецЕсли; 
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Если Результат.Успешно Тогда
		ДатаФормированияКомплекта = ТекущаяДата();		
		//ДобавитьСтатусыКДвижениям(ЛистСборки, Результат.Данные, ДатаФормированияКомплекта);		
		
		ЗаписатьКомплектВЛистСборки(ЛистСборки, Результат.Данные, ДатаФормированияКомплекта);	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ДобавитьКомплектВЛистСборки(ЛистСборки, ПродукцияВход, Комплектующие) Экспорт

Функция ДобавитьСтатусыКДвижениям(ЛистСборки, ДанныеКомплекта, ДатаФормированияКомплекта)
	Подразделение = ПолучитьРеквизитШапки(ЛистСборки, "Подразделение");
	
	Если ЗначениеЗаполнено(ЛистСборки) И ТипЗнч(ЛистСборки) = Тип("ДокументСсылка.ЛистСборкиКомплектовЧЗ") Тогда
		НЗ = РегистрыСведений.СтатусыКМ_Факт.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(ЛистСборки, Истина);
		
		Запись = НЗ.Добавить();
		
		Запись.Период 			= ДатаФормированияКомплекта;
		Запись.Регистратор		= ЛистСборки;
		Запись.ШтрихКодУпаковки = ДанныеКомплекта.ШтрихкодКомплекта;
		Запись.Местонахождение	= Подразделение;
		
		Для каждого СтрокаК Из ДанныеКомплекта.КодыКомплектующих Цикл
			Запись = НЗ.Добавить();
		
			Запись.Период 			= ДатаФормированияКомплекта;
			Запись.Регистратор		= ЛистСборки;
			Запись.ШтрихКодУпаковки = СтрокаК.ШтрихКод;
			Запись.Местонахождение	= Подразделение;		
		КонецЦикла; 
		
		НЗ.Записать(Ложь);	
	КонецЕсли;
КонецФункции //ДобавитьСтатусыКДвижениям(ЛистСборки, Результат.Данные)

Функция ЗаписатьКомплектВЛистСборки(ЛистСборки, ДанныеКомплекта, ДатаФормированияКомплекта)
	ДокОбъект = ЛистСборки.ПолучитьОбъект();
	
	ШтрихкодКомплекта = ДанныеКомплекта.ШтрихкодКомплекта;
	
	Для Каждого СтрокаК Из ДанныеКомплекта.КодыКомплектующих Цикл
		СтрокаК.Комплектующее 				= СтрокаК.Номенклатура;
		СтрокаК.ШтрихкодУпаковки			= СтрокаК.ШтрихКод;
		СтрокаК.ШтрихкодКомплекта   		= ШтрихкодКомплекта;	
		СтрокаК.ДатаФормированияКомплекта   = ДатаФормированияКомплекта;
	КонецЦикла; 
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецФункции

Функция ПроверитьДублиКодов(ЛистСборки, Комплектующие)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = " 
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Комплектующие ИЗ &Комплектующие КАК Комплектующие 
	|;
	|ВЫБРАТЬ
	|	ВТ_Комплектующие.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВТ_Комплектующие
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ТЧ
	|ПО
	|	ТЧ.Ссылка = &ЛистСборки
	|	И ТЧ.ШтрихкодУпаковки = Комплектующие.ШтрихКод
	|";
	
	Запрос.УстановитьПараметр("ЛистСборки", 	ЛистСборки);
	Запрос.УстановитьПараметр("Комплектующие",	Комплектующие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = СтрШаблон("Код комплектующего: %1 уже присутствует в листе сборки комплекта !", Выборка.ШтрихКод);
		Результат.Ошибки.Добавить(ТекстОшибки);		
	КонецЦикла; 
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПроверитьДублиКодов(ЛистСборки, Комплектующие)

Функция НайтиСоздатьЛистСборки(ЗаданиеНаСборкуКомплектов, ЛистНабора) Экспорт	
	Ссылка = НайтиДокумент("ЛистСборкиКомплектовЧЗ", Новый Структура("ДокОснование,ЛистНабора", ЗаданиеНаСборкуКомплектов, ЛистНабора));
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Результат = Ссылка;
	Иначе		
		ДокОбъект = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент();	
		ДокОбъект.Заполнить(ЗаданиеНаСборкуКомплектов);
		ДокОбъект.ЛистНабора = ЛистНабора;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат = ДокОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьЛистСборки(ЗаданиеНаСборкуКомплектовЧЗ, ЛистНабора) Экспорт

Функция ДобавитьСпайкуFBSВЛСК (ТаблицаКодов,КодНабора,ЗСБ) экспорт
	
	СтруктураОтвета=новый Структура("Успех,Ошибки",Истина,"");
	МассивОшибок=новый Массив;
	ЛСК=ПолучитьЛСКДляFBS(ЗСБ);
	ЛСКОбъект=ЛСК.ПолучитьОбъект();
	
	если ЛСКОбъект.ШтрихкодыУпаковок.Найти(КодНабора,"ШтрихкодКомплекта") <> Неопределено тогда
		 МассивОшибок.Добавить("Обнаружен дубль набора в ЛСК "+ЛСКОбъект.Номер+" по коду "+КодНабора);
	КонецЕсли;
	
	
	Для Каждого СтрокаТЗ из ТаблицаКодов цикл
		КодЧЗ=СтрокаТЗ.МаркаЧЗ;
		если не ЗначениеЗаполнено(КодЧЗ) тогда
			Продолжить;
		КонецЕсли;
		если ЛСКОбъект.ШтрихкодыУпаковок.Найти(КодЧЗ,"ШтрихкодУпаковки") <> Неопределено тогда
			МассивОшибок.Добавить("Обнаружен дубль комплектующей в ЛСК "+ЛСКОбъект.Номер+" по коду "+КодЧЗ);
			Продолжить;
		КонецЕсли;		
		СтрТЧ = ЛСКОбъект.ШтрихкодыУпаковок.Добавить();
		СтрТЧ.ДатаФормированияКомплекта=ТекущаяДата();
		СтрТЧ.Комплектующее=СтрокаТЗ.Номенклатура;
		СтрТЧ.ШтрихкодКомплекта=КодНабора;
		СтрТЧ.ШтрихкодУпаковки=КодЧЗ;	
		СтрТЧ.КодКомплектующегоНеНанесен=СтрокаТЗ.НанесенияНеБыло; 
	КонецЦикла;
	
	если МассивОшибок.Количество()=0 тогда
		попытка
			ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			МассивОшибок.Добавить("Не удалось записать документ по причине "+ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли; 
	
	
	если МассивОшибок.Количество()>0 тогда
		СтруктураОтвета.успех=ложь;
		СтруктураОтвета.Ошибки=СтрСоединить(МассивОшибок,символы.ПС);
	КонецЕсли;
	
	возврат СтруктураОтвета;
КонецФункции

Функция ТекстЗапроса_ВсеКодыДокумента()
	Возврат "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки,ШтрихкодКомплекта,ШтрихкодКоробки
	|ПОМЕСТИТЬ ВТ_ШтрихкодыУпаковок
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_ВсеКМДокумента
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодУпаковки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодКомплекта
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодКомплекта <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ШтрихкодКоробки
	|ИЗ
	|	ВТ_ШтрихкодыУпаковок
	|ГДЕ	
	|	ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|";
	
КонецФункции

Функция ПолучитьПорцииКМДляПроверки(ДокСсылка, РазмерПорции = 1000) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ВсеКодыДокумента() + "
	|;
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ИспользованныеКодыАгрегаций КАК ИспользованныеКА
	|ПО 	
	|	ИспользованныеКА.ШтрихКодУпаковки = ВТ_ВсеКМДокумента.ШтрихКодУпаковки
	|	И ИспользованныеКА.Регистратор ССЫЛКА Документ.МаркировкаТоваровИСМП
	|	И ИспользованныеКА.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументовМаркировки.Обработан)
	|	И ИспользованныеКА.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийМаркировки.Агрегация)
	|	И ИспользованныеКА.Регистратор.ДокументОснование ССЫЛКА Документ.РасходнаяНакладная
	|ГДЕ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода = ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|ОБЪЕДИНИТЬ
	|ВЫБРАТЬ
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.Наименование КАК ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента
	|ГДЕ 
	|	ВТ_ВсеКМДокумента.ШтрихкодУпаковки.ТипКода <> ЗНАЧЕНИЕ(Перечисление.ТипыКодовМаркировки.ЛогистическаяУпаковка)
	|";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрок 	= Выборка.Количество();
	Сч			= 0;
	
	Порции = Новый Массив;
	ТекПорция = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Сч = Сч + 1;
		
		ТекПорция.Добавить(Выборка.ШтрихкодУпаковки);
		Если ТекПорция.Количество() >= РазмерПорции ИЛИ Сч >= ВсегоСтрок Тогда
			Порции.Добавить(ТекПорция);
			ТекПорция = Новый Массив;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Порции;
КонецФункции //ПолучитьКМДляПроверки(ДокСсылка) Экспорт

Функция ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_ВсеКодыДокумента() + "
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ИЗ
	|	ВТ_ВсеКМДокумента	
	|";                                                                                
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуКМДокумента(ДокСсылка, ДопПараметры = Неопределено) Экспорт

// Кухарь А.Ю.  27.03.2025 начало
// Пустая задача

// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
//Функция ПолучитьЛСКДляFBS(ЗСБ) Экспорт 

// Кельманов А.В. - Оптимизация работы - 2026.04.14 {
//Функция ПолучитьЛСКДляFBS(ЗСБ, УзелТСД = Неопределено, СборщикКомплектаТСД = Неопределено) Экспорт 

// Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 {
//Функция ПолучитьЛСКДляFBS(ЗСБ, УзелТСД = Неопределено, СборщикКомплектаТСД = Неопределено, СоздаватьНовый = Ложь) Экспорт 
Функция ПолучитьЛСКДляFBS(ЗСБ, УзелТСД = Неопределено, СборщикКомплектаТСД = Неопределено, СоздаватьНовый = Ложь, НеПривязанКЛП = Ложь) Экспорт 
// Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 }

	// Кельманов А.В. - Оптимизация работы - 2026.04.14 }

	// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
	
	ЛСКОбъект = Неопределено;
	
	// Кельманов А.В. - Оптимизация работы - 2026.04.14 {
	Если Не СоздаватьНовый Тогда
		// Кельманов А.В. - Оптимизация работы - 2026.04.14 } 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛистСборкиКомплектовЧЗ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЛистСборкиКомплектовЧЗ КАК ЛистСборкиКомплектовЧЗ
					   // Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 {
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки КАК ЛистПереукладки
		               |		ПО ЛистСборкиКомплектовЧЗ.Ссылка = ЛистПереукладки.ЛСК
					   // Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 }
		               |ГДЕ
		               |	ЛистСборкиКомплектовЧЗ.Автор = &Автор
		               |	И ЛистСборкиКомплектовЧЗ.Проведен
		               |	И ЛистСборкиКомплектовЧЗ.ДокОснование = &ЗСБ";
		
		Запрос.УстановитьПараметр("Автор", ПараметрыСеанса.Пользователь);
		Запрос.УстановитьПараметр("ЗСБ", ЗСБ);
		
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
		Если ЗначениеЗаполнено(УзелТСД) Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И ЛистСборкиКомплектовЧЗ.УзелТСД = &УзелТСД";
			
			Запрос.УстановитьПараметр("УзелТСД", УзелТСД); 
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СборщикКомплектаТСД) Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И ЛистСборкиКомплектовЧЗ.СборщикКомплектаТСД = &СборщикКомплектаТСД";
			
			Запрос.УстановитьПараметр("СборщикКомплектаТСД", СборщикКомплектаТСД); 
			
		КонецЕсли;
		// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
		
		// Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 {
		Если НеПривязанКЛП Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И ЛистПереукладки.Ссылка ЕСТЬ NULL";
			
		КонецЕсли;
		// Кельманов А.В. - HELP-9791 + HELP-9793 - 2026.05.18 }
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Возврат Выборка.Ссылка;
		КонецЦикла;
		
		// Кельманов А.В. - Оптимизация работы - 2026.04.14 {
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2026.04.14 } 

	ЛСКОбъект = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент();
	ЛСКОбъект.Дата = ТекущаяДата();			
	
	//+++Чирков 2025.04.05
	//ЛСКОбъект.ОбработкаЗаполнения(ЗСБ,"",Истина);
	ЛСКОбъект.Заполнить(ЗСБ);
	//---Чирков 2025.04.05
	
	// Кельманов А.В. - Оптимизация работы - 2025.04.30 {
	Если ЗначениеЗаполнено(УзелТСД) Тогда
		
		ЛСКОбъект.УзелТСД = УзелТСД;		
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СборщикКомплектаТСД) Тогда
		
		ЛСКОбъект.СборщикКомплектаТСД = СборщикКомплектаТСД;		
		
	КонецЕсли;
	// Кельманов А.В. - Оптимизация работы - 2025.04.30 }
	
	ЛСКОбъект.Товары.Очистить();
	ЛСКОбъект.ШтрихкодыУпаковок.Очистить();
	ЛСКОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ЛСКОбъект.Ссылка;
	
КонецФункции

// Кухарь А.Ю.  27.03.2025 конец

Функция НайтиСоздатьЗаданиеНаСборку(Накладная, ЛистНабора) Экспорт
	Ссылка = НайтиДокумент("ЗаданиеНаСборкуКомплектовЧЗ", Новый Структура("ДокОснование,ЛистНабора", Накладная, ЛистНабора));
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Результат = Ссылка;
	Иначе		
		ДокОбъект = Документы.ЗаданиеНаСборкуКомплектовЧЗ.СоздатьДокумент();	
		ДокОбъект.Заполнить(Накладная);
		ДокОбъект.ЛистНабора = ЛистНабора;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат = ДокОбъект.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //НайтиСоздатьЛистСборки(ЗаданиеНаСборкуКомплектовЧЗ, ЛистНабора) Экспорт 
   
// Кельманов А.В. - HELP-4052 - 2025.05.14 {
//Функция ПолучитьЗабронироватьКМПакетно(Продукция, КоличествоПродукции, ЛистСборки) Экспорт
Функция ПолучитьЗабронироватьКМПакетно(Продукция, КоличествоПродукции, ЛистСборки, Знач ДопПараметры = Неопределено) Экспорт
// Кельманов А.В. - HELP-4052 - 2025.05.14 }

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	ДатаФормированияКомплекта = ТекущаяДата();
	
	// Кельманов А.В. - HELP-4052 - 2025.05.14 {
	//пПолучения	= Новый Структура(
	//	"Период,Количество,Статус,НовыйСтатус,ТипКода,Добавлять", 
	//	ДатаФормированияКомплекта, КоличествоПродукции, Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати, 
	//	Перечисления.СтатусыКодовМаркировкиФакт.Нанесен, Перечисления.ТипыКодовМаркировки.Набор, Истина
	//);
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;	
	КонецЕсли;
	
	Статус = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПараметры, "Статус", Перечисления.СтатусыКодовМаркировкиФакт.ГотовКПечати);
	
	пПолучения	= Новый Структура(
		"Период,Количество,Статус,НовыйСтатус,ТипКода,Добавлять", 
		ДатаФормированияКомплекта, КоличествоПродукции, Статус, 
		Перечисления.СтатусыКодовМаркировкиФакт.Нанесен, Перечисления.ТипыКодовМаркировки.Набор, Истина
	);	

	Если ДопПараметры.Свойство("МассивДоступныхКодов") Тогда
		пПолучения.Вставить("МассивДоступныхКодов", ДопПараметры.МассивДоступныхКодов);	
	КонецЕсли;
	// Кельманов А.В. - HELP-4052 - 2025.05.14 }
	
	рПолучения 	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Продукция, ЛистСборки, пПолучения);
		
	Если рПолучения.Успешно Тогда
		КодыПродукции = рПолучения.Данные[Продукция];
	Иначе	
		МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура							КАК Номенклатура,		
	|	Номенклатура.Родитель.ВидНоменклатуры 	КАК ВидНоменклатуры,
	|	СУММА(Количество) 						КАК Количество
	|ИЗ
	|	Справочник.Номенклатура.Коплектующие 
	|ГДЕ
	|	Ссылка = &Продукция	
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|";
	
	Запрос.УстановитьПараметр("Продукция", Продукция);	
	
	ВсеКодыКомплектующих = Новый Массив;
	
	ТР = Документы.ЛистСборкиКомплектовЧЗ.СоздатьДокумент().ШтрихкодыУпаковок.ВыгрузитьКолонки();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.Товар Тогда			
			Количество	= Выборка.Количество*КоличествоПродукции;
			ДопПараметры = Новый Структура("Количество,Период,НовыйСтатус,Добавлять", Количество, ДатаФормированияКомплекта, Перечисления.СтатусыКодовМаркировкиФакт.Вложен, Истина);
			рПолучения	= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыШтук(Выборка.Номенклатура, ЛистСборки, ДопПараметры);
			Если рПолучения.Успешно Тогда
				КодыКомплектующих = Новый Массив;
				Для Каждого КиЗ Из рПолучения.Данные Цикл
					Для каждого ШтрихкодУпаковки Из КиЗ.Значение Цикл
						ВсеКодыКомплектующих.Добавить(ШтрихкодУпаковки);
						КодыКомплектующих.Добавить(ШтрихкодУпаковки);
					КонецЦикла;					
				КонецЦикла;
				
				Для НомерКомплекта = 0 По КоличествоПродукции - 1 Цикл
					Для НомерПродукции = 0 По Выборка.Количество - 1 Цикл
						СтрокаТР = ТР.Добавить();
						
						СтрокаТР.ШтрихкодКомплекта			= КодыПродукции[НомерКомплекта];
						СтрокаТР.Комплектующее 				= Выборка.Номенклатура;						
						СтрокаТР.ШтрихкодУпаковки   		= КодыКомплектующих[НомерКомплекта*Выборка.Количество + НомерПродукции];
						СтрокаТР.КодКомплектующегоНеНанесен = Истина;
						СтрокаТР.ДатаФормированияКомплекта  = ДатаФормированияКомплекта;
					КонецЦикла;									
				КонецЦикла;
			Иначе
				МаркировкаКС.ДобавитьОшибки(Результат, рПолучения);
				Прервать;
			КонецЕсли;
		Иначе			
			Для НомерКомплекта = 0 По КоличествоПродукции - 1 Цикл
				Для НомерПродукции = 0 По Выборка.Количество - 1 Цикл
					СтрокаТР = ТР.Добавить();
					
					СтрокаТР.ШтрихкодКомплекта			= КодыПродукции[НомерКомплекта];
					СтрокаТР.Комплектующее 				= Выборка.Номенклатура;
					СтрокаТР.КодКомплектующегоНеНанесен = Истина;
					СтрокаТР.ДатаФормированияКомплекта  = ДатаФормированияКомплекта;
				КонецЦикла;									
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если Результат.Ошибки.Количество() = 0 Тогда
		РегистрыСведений.СтатусыКМ_Факт.УстановитьСтатусКМ(ВсеКодыКомплектующих, Перечисления.СтатусыКодовМаркировкиФакт.НанесенВиртуально,	ЛистСборки, Новый Структура("Добавлять,Период,ИспользоватьУправляемыеБлокировки", Истина, ДатаФормированияКомплекта - 1, Истина));
		
		Результат.Успешно	= Истина;
		Результат.Данные	= ТР;	
	КонецЕсли;
	
	ТекстСообщения = "Документ.ЛистСборкиКомплектовЧЗ.ПолучитьЗабронироватьКМПакетно";
	ЗаписатьВЛог("Мониторинг СтатусыКМ_Факт", ТекстСообщения, , , , (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000);
	
	Возврат Результат;
КонецФункции //ПолучитьЗабронироватьКМПакетно(Набор)

Функция ПроверитьДублиКодовКомплектов(ЛСК_Тек) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка,
	|	ШтрихкодКомплекта
	|ПОМЕСТИТЬ ВТ_КомплектыТек
	|ИЗ
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок 
	|ГДЕ
	|	Ссылка = &ЛСК_Тек
	|	И ШтрихкодКомплекта<>ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыУпаковок.Ссылка 						КАК ЛСК_Дубль,
	|	ВТ_КомплектыТек.ШтрихкодКомплекта				КАК ШтрихкодКомплекта,
	|	ВТ_КомплектыТек.ШтрихкодКомплекта.Владелец		КАК Номенклатура,
	|	ВТ_КомплектыТек.ШтрихкодКомплекта.Владелец.Код	КАК Номенклатура_Код
	|ИЗ
	|	ВТ_КомплектыТек	
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Документ.ЛистСборкиКомплектовЧЗ.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|ПО
	|	ШтрихкодыУпаковок.ШтрихкодКомплекта = ВТ_КомплектыТек.ШтрихкодКомплекта
	|	И ШтрихкодыУпаковок.Ссылка <> ВТ_КомплектыТек.Ссылка
	|";	
	
	Запрос.УстановитьПараметр("ЛСК_Тек", ЛСК_Тек);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = СтрШаблон("Дублирован КМ комплекта: '%1' ! Номенклатура: '%2' (%3), документ дубль: %4 !!!", 
			Выборка.ШтрихкодКомплекта, Выборка.Номенклатура, Выборка.Номенклатура_Код, Выборка.ЛСК_Дубль);
		Результат.Ошибки.Добавить(ТекстСообщения); 			
	КонецЦикла;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции // ПроверитьДублиКодовКомплектов(ЛСК_Тек) Экспорт

Функция ОчиститьДвижения(ДокСсылка) Экспорт
	РегистрыСведений.СтатусыКМ_Факт.ОчиститьДвижения(ДокСсылка);
	РегистрыСведений.СтатусыКМ_Факт_А.ОчиститьДвижения(ДокСсылка);
	РегистрыНакопления.ОстаткиДоступныхКМ.ОчиститьДвижения(ДокСсылка);
КонецФункции //ОчиститьДвижения(ДокСсылка) Экспорт

// Шворобей ВЮ 15.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4854
#Область ДополнительныеФункции

Функция ЗаписатьВЖурналИзмененийРеквизитовДокумента(Документ, ИмяРеквизита = "ОчисткаЛСК", СтароеЗначение = Неопределено,
		НовоеЗначение = Неопределено) Экспорт

	Запись = РегистрыСведений.ЖурналИзмененийРеквизитов.СоздатьМенеджерЗаписи();
	
       Запись.Дата = ТекущаяДатаСеанса();
	Запись.Документ = Документ;
	Запись.ИмяРеквизита = ИмяРеквизита;

	Если СтароеЗначение <> Неопределено Тогда
		Запись.СтароеЗначение = СтароеЗначение;
	КонецЕсли;
	Если НовоеЗначение <> Неопределено Тогда
		Запись.НовоеЗначение = НовоеЗначение;
	КонецЕсли;
	
	Запись.Пользователь = ПараметрыСеанса.Пользователь;
	Запись.ТипДокумента = Документ.Метаданные().Имя;
	
	Попытка
		Запись.Записать();
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти
// Шворобей ВЮ 15.05.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-4854
